Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum
Defines building space operations done on Tekla Structures core side

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_CREATE_OBJECT
The creation of new object.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_MODIFY_OBJECT
Update the object.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_SELECT_OBJECT
Select the object.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_DELETE_OBJECT
Delete the object.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_SELECT_ASSIGNED_OBJECTS
Select assigned objects in 3d view.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_HIDE_ASSIGNED_OBJECTS
Hide assigned objects in 3d view.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_SHOW_ASSIGNED_OBJECTS
Show previously hidden assigned objects in 3d view.

Tekla.Structures.Model.BuildingSpaces.dotBuildingSpaceOperationsEnum.DOT_SPACE_SHOW_ONLY_ASSIGNED_OBJECTS
Show only assigned objects in 3d view.